app/Controllers/Inicio.php

    public function registrobd()
    {
        $MascotaM = new ModeloMascota();

        $data = [
            'nombre'  => $this->request->getPost('pet_nombre'),
            'especie'  => $this->request->getPost('pet_especie'),
            'raza'  => $this->request->getPost('pet_raza'),
            'fecha_nacimiento'  => $this->request->getPost('pet_date'),
            'sexo'  => $this->request->getPost('pet_sexo'),
            'color'  => $this->request->getPost('pet_color'),
            'peso'  => $this->request->getPost('pet_peso'),

            'nombre_dueno'  => $this->request->getPost('nombre'),
            'telefono_dueno'  => $this->request->getPost('telefono'),
            'email_dueno'  => $this->request->getPost('correo')
        ];

         if(isset($data))
        {
            $MascotaM->insert($data);
---
INSERT INTO `mascotas` (`nombre`, `especie`, `raza`, `fecha_nacimiento`, `sexo`, `color`, `peso`, `nombre_dueno`, `telefono_dueno`, `email_dueno`, `fecha_registro`, `fecha_actualiza`) VALUES ('Firulais', 'Perro', 'Perro', '275760-05-01', 'masculino', 'hola', '4564513', 'Nico', '4654121', 'nico@gmail.com', '2024-10-28 05:24:24', '2024-10-28 05:24:24')